lib/tasks/dev.rake

SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT `mining_types`.* FROM `mining_types`
SELECT  "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_image" = ? AND "coins"."mining_type_id" IN (SELECT "mining_types"."id" FROM "mining_types" WHERE "mining_types"."acronym" = ?) LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", "https://imagepng.org/wp-content/uploads/2017/06/moeda-bitcoin-coin.png"], ["acronym", "PoW"], ["LIMIT", 1]]
SELECT  "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_image" = ? LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", "https://imagepng.org/wp-content/uploads/2017/06/moeda-bitcoin-coin.png"], ["LIMIT", 1]]
INSERT INTO `coins` (`description`, `acronym`, `url_image`, `created_at`, `updated_at`, `mining_type_id`) VALUES ('Bitcoin', 'BTC', 'https://imagepng.org/wp-content/uploads/2017/06/moeda-bitcoin-coin.png', '2019-03-26 20:19:39', '2019-03-26 20:19:39', 1)
---
  task add_coins: :environment do
    show_spinner("Cadastrando moedas...") do

      coins = [ { description: "Bitcoin",
                  acronym: "BTC",
                  url_image: "https://imagepng.org/wp-content/uploads/2017/06/moeda-bitcoin-coin.png",
                  mining_type: MiningType.find_by(acronym: 'PoW')
                },
                { description: "Ethereum",
                  acronym: "ETH",
                  url_image: "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/ETHEREUM-YOUTUBE-PROFILE-PIC.png/600px-ETHEREUM-YOUTUBE-PROFILE-PIC.png",
                  mining_type: MiningType.all.sample
                },
                { description: "Dash",
                  acronym: "DASH",
                  url_image: "https://cdn.freebiesupply.com/logos/large/2x/dash-3-logo-png-transparent.png",
                  mining_type: MiningType.all.sample
                },
                { description: "Iota",
                  acronym: "IOT",
                  url_image: "https://icon2.kisspng.com/20180712/faa/kisspng-iota-cryptocurrency-logo-internet-of-things-tether-aren-5b481f06876cc2.5540898915314531905547.jpg",
                  mining_type: MiningType.all.sample
                },
                { description: "ZCash",
                  acronym: "ZEC",
                  url_image: "https://s2.coinmarketcap.com/static/img/coins/200x200/1437.png",
                  mining_type: MiningType.all.sample
                }]

      coins.each do |coin|
          Coin.find_or_create_by!(coin)

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2019-03-11 20:08:28.030720"], ["updated_at", "2019-03-11 20:08:28.030720"]]
---
  task add_mining_types: :environment do
    show_spinner("Cadastrando tipos de mineração...") do

      mining_types = [{description:"Proof of Work", acronym: "PoW"},
                      {description:"Proof of Stake", acronym:"PoS"},
                      {description:"Proof of Capacity", acronym:"PoC"}]
      mining_types.each do |type|
        MiningType.find_or_create_by!(type)