app/controllers/coins_controller.rb

SELECT `coins`.* FROM `coins`
---
  def index
    @coins = Coin.all

INSERT INTO `coins` (`description`, `acronym`, `url_image`, `created_at`, `updated_at`, `mining_type_id`) VALUES ('adhgh', 'afdxdgg', 'https://banner2.kisspng.com/20171220/bhe/bitcoin-png-5a3a2702388611.73714972151376051423153857.jpg', '2019-03-27 16:05:38', '2019-03-27 16:05:38', 1)
---
  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save

UPDATE `coins` SET `acronym` = 'afdxdggasd', `updated_at` = '2019-03-27 16:06:04' WHERE `coins`.`id` = 6
---
  def update
    respond_to do |format|
      if @coin.update(coin_params)

DELETE FROM `coins` WHERE `coins`.`id` = 7
---
  def destroy
    @coin.destroy

SELECT `mining_types`.`description`, `mining_types`.`id` FROM `mining_types`
---
    def set_mining_type_options
      @mining_type_options = MiningType.all.pluck(:description,:id)